Channel/1D/R0550/0/RS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      RS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor> 
1025
(
(6.4302e-08 -5.10673e-12 3.73493e-11 9.81572e-15 -6.53994e-15 2.65956e-08)
(5.32771e-07 -1.1695e-10 3.09925e-10 6.18751e-13 -1.49324e-13 2.19192e-07)
(1.53584e-06 -6.28723e-10 8.95239e-10 6.47621e-12 -7.99063e-13 6.27394e-07)
(2.74866e-06 -1.30605e-09 1.60332e-09 1.45546e-11 -1.6586e-12 1.12006e-06)
(4.71954e-06 -3.20884e-09 2.75884e-09 5.3807e-11 -4.05274e-12 1.90869e-06)
(7.08061e-06 -5.73945e-09 4.14466e-09 1.09008e-10 -7.23308e-12 2.84972e-06)
(9.45281e-06 -8.28198e-09 5.53702e-09 1.6447e-10 -1.04284e-11 3.79518e-06)
(1.27213e-05 -1.34325e-08 7.46529e-09 3.30166e-10 -1.683e-11 5.0743e-06)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    CENTER
    {
        type            symmetryPlane;
    }
    WALL
    {
        type            fixedValue;
        value           uniform (6.66667e-11 0 0 6.66667e-11 0 6.66667e-11);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
