Channel/1D/R0550/0/divRS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      divRS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];


internalField   nonuniform List<vector> 
1025
(
(-1.58057e-06 -1.72218e-06 -2.01836e-09)
(-8.04283e-06 8.33642e-08 -1.02213e-08)
(-1.52821e-05 1.79093e-07 -1.9397e-08)
(-3.2978e-05 6.04702e-07 -4.15875e-08)
(-5.64446e-05 1.20247e-06 -7.09726e-08)
(-6.43077e-05 1.40278e-06 -8.08186e-08)
(-9.69843e-05 2.78704e-06 -1.20987e-07)
(-0.000159779 5.44718e-06 -1.98181e-07)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    CENTER
    {
        type            symmetryPlane;
    }
    WALL
    {
        type            extrapolatedCalculated;
        value           uniform (-1.58057e-06 -1.72218e-06 -2.01836e-09);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
